; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_4 ?v7 - type_1 ?v4 - type_3)
 	      (pred_2 ?v2 - object ?v4 - type_3)
	      (pred_3 ?v7 - type_1 ?v6 - type_2)
	      (pred_1 ?v7 - type_1 ?v2 - object ?v6 - type_2))

   (:action op_3
       :parameters  (?v7 - type_1 ?v8 ?v3 - type_3)
       :precondition (and  (pred_4 ?v7 ?v8))
       :effect (and  (pred_4 ?v7 ?v3)
		     (not (pred_4 ?v7 ?v8))))

   (:action op_2
       :parameters (?v7 - type_1 ?v1 - object ?v5 - type_3 ?v6 - type_2)
       :precondition  (and  (pred_2 ?v1 ?v5) (pred_4 ?v7 ?v5) (pred_3 ?v7 ?v6))
       :effect (and (pred_1 ?v7 ?v1 ?v6)
		    (not (pred_2 ?v1 ?v5)) 
		    (not (pred_3 ?v7 ?v6))))

   (:action op_1
       :parameters (?v7 - type_1 ?v1 - object ?v5 - type_3 ?v6 - type_2)
       :precondition  (and  (pred_1 ?v7 ?v1 ?v6) (pred_4 ?v7 ?v5))
       :effect (and (pred_2 ?v1 ?v5)
		    (pred_3 ?v7 ?v6)
		    (not (pred_1 ?v7 ?v1 ?v6)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_05 - type_1
obj_09 obj_08 - type_2
obj_03 obj_02 obj_07 obj_01 - type_3
obj_06 obj_04 obj_10 - object)
(:init
(pred_4 obj_05 obj_02)
(pred_3 obj_05 obj_09)
(pred_3 obj_05 obj_08)
(pred_2 obj_06 obj_02)
(pred_2 obj_04 obj_02)
(pred_2 obj_10 obj_01)
)
(:goal
(and
(pred_2 obj_06 obj_02)
(pred_2 obj_04 obj_07)
(pred_2 obj_10 obj_07)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_05 ?b obj_08))))
)
)

; plan
1. (op_2 obj_05 obj_04 obj_02 obj_09)
   deleted: (pred_2 obj_04 obj_02) (pred_3 obj_05 obj_09)
   added: (pred_1 obj_05 obj_04 obj_09)
   goals met: 1 of 3
2. (op_3 obj_05 obj_02 obj_07)
   deleted: (pred_4 obj_05 obj_02)
   added: (pred_4 obj_05 obj_07)
   goals met: 1 of 3
3. (op_1 obj_05 obj_04 obj_07 obj_09)
   deleted: (pred_1 obj_05 obj_04 obj_09)
   added: (pred_2 obj_04 obj_07) (pred_3 obj_05 obj_09)
   goals met: 2 of 3
4. (op_3 obj_05 obj_07 obj_01)
   deleted: (pred_4 obj_05 obj_07)
   added: (pred_4 obj_05 obj_01)
   goals met: 2 of 3
5. (op_2 obj_05 obj_10 obj_01 obj_09)
   deleted: (pred_2 obj_10 obj_01) (pred_3 obj_05 obj_09)
   added: (pred_1 obj_05 obj_10 obj_09)
   goals met: 2 of 3
6. (op_3 obj_05 obj_01 obj_07)
   deleted: (pred_4 obj_05 obj_01)
   added: (pred_4 obj_05 obj_07)
   goals met: 2 of 3
7. (op_1 obj_05 obj_10 obj_07 obj_09)
   deleted: (pred_1 obj_05 obj_10 obj_09)
   added: (pred_2 obj_10 obj_07) (pred_3 obj_05 obj_09)
   goals met: 3 of 3
